Documents/Renault_ИзменитьПриоритетПродажАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ИзменитьПриоритетПродажАвтомобиля</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_ПриоритетыПродажАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриоритетыАвтомобилей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыйПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ПриоритетыПродажАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПриоритетыПродажАвтомобилей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_ИзменитьПриоритетПродажАвтомобиля/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПараметрыСеанса.Renault_ПраваПользователя.ИспользоватьПриоритетыПродажАвтомобилей Тогда
		Сообщить("Нет прав на использование функционала ""Приоритеты продаж автомобиля""!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийПользователь = ПараметрыСеанса.Пользователь;
		
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 	
			Объект.Автор = ТекущийПользователь;
		Иначе
			Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
			Элементы.Автор.ТолькоПросмотр = Ложь;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетыАвтомобилейАвтомобильПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПриоритетыАвтомобилей.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.Автомобиль) Тогда
		ТабПриоритетыАвтомобилей = Объект.ПриоритетыАвтомобилей;
		
		Для Каждого Эл Из ТабПриоритетыАвтомобилей Цикл
			Если Эл <> ТекущаяСтрока И ТекущаяСтрока.Автомобиль = Эл.Автомобиль Тогда
				ТекущаяСтрока.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
				
				Сообщить("Выбранный автомобиль уже есть в табличной части!");
				Возврат;
			КонецЕсли;			
		КонецЦикла;
		
		ДатаПолученияПриоритета = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата());
		ТекущаяСтрока.СтарыйПриоритет = ПолучитьСтарыйПриоритет(ТекущаяСтрока.Автомобиль, ДатаПолученияПриоритета);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияИзменитьПриоритетыПродажАвтомобилей(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФормаСписка = РегистрыСведений.Renault_ПриоритетыПродажАвтомобилей.ПолучитьФормуСписка();
		ФормаСписка.Отбор.Регистратор.Значение = Объект.Ссылка;
		ФормаСписка.Отбор.Регистратор.Использование = Истина;
		ФормаСписка.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
		
		ФормаСписка.ЭлементыФормы.РегистрСведенийСписок.НастройкаОтбора.Регистратор.Доступность = Ложь;
		
		ФормаСписка.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтарыйПриоритет(Автомобиль, ДатаПолученияПриоритета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	
	Возврат  ОбъектСервер.ПолучитьСтарыйПриоритет(Автомобиль, ДатаПолученияПриоритета);
КонецФункции
